# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # YOLOE-v8s neck depth
width_multiple: 0.50 # YOLOE-v8s neck width

# YOLOE + ConvNeXtV2-Small backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TimmBackbone, [convnextv2_small, False, [1, 2, 3]]] # 0: C3/C4/C5, pretrained=False
  - [0, 1, FeatureSelect, [0]] # 1-P3/8, 192 channels
  - [0, 1, FeatureSelect, [1]] # 2-P4/16, 384 channels
  - [0, 1, FeatureSelect, [2]] # 3-P5/32, 768 channels
  - [-1, 1, SPPF, [1024, 5]] # 4-P5/32, mirrors stock YOLOE before the PAN neck

# YOLOE-v8s detection neck/head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 10 (P3/8-small)

  - [10, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 16 (P5/32-large)

  - [[10, 13, 16], 1, YOLOEDetect, [nc, 512, True]] # Detect(P3, P4, P5)
