# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # YOLOE-v8s neck depth
width_multiple: 0.50 # YOLOE-v8s neck width

# Auxiliary depth head settings. Detection neck/head below stays unchanged.
depth_head:
  from: [1, 2, 3, 4] # C2/C3/C4/C5 ConvNeXtV2 features
  channels: [96, 192, 384, 768]
  hidden: 64
  lambda_depth: 1.0
  sparse_weight: 1.0
  loss_type: spnet_absolute_relative_gradient
  output_activation: identity

# YOLOE + ConvNeXtV2-Small backbone with C2/C3/C4/C5 exposed for depth.
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TimmBackbone, [convnextv2_small, False, [0, 1, 2, 3]]] # 0: C2/C3/C4/C5, pretrained=False
  - [0, 1, FeatureSelect, [0]] # 1-C2/4, 96 channels
  - [0, 1, FeatureSelect, [1]] # 2-P3/8, 192 channels
  - [0, 1, FeatureSelect, [2]] # 3-P4/16, 384 channels
  - [0, 1, FeatureSelect, [3]] # 4-P5/32, 768 channels
  - [-1, 1, SPPF, [1024, 5]] # 5-P5/32, mirrors stock YOLOE before the PAN neck

# YOLOE-v8s detection neck/head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 11 (P3/8-small)

  - [11, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, YOLOEDetect, [nc, 512, True]] # Detect(P3, P4, P5)
